[Tech_LegionChassis X2TechTemplate]
DisplayName="Legion Chassis"
Summary="A heavy SPARK chassis which provides great protection and survivability, but at the cost of regular chassis' mobility. This chassis grants the SPARK unit new combat abilities, allow it to support our squads with heavy firepower."
CodeName="Legion"

[Tech_SPARKCannon_LS X2TechTemplate]
DisplayName="BSG-12 Laser Minigun"
Summary="Gatling Cannons are much heavier versions of the miniguns carried by regular soldiers. This robust weapon provides heavy firepower and can only be used by our SPARKs. Its capability is now further improved by laser weapon tech."

[Tech_SPARKCannon_MG X2TechTemplate]
DisplayName="BSG-17 Rail-Cannon"
Summary="Gatling Cannons are much heavier versions of the miniguns carried by regular soldiers. This robust weapon provides heavy firepower and can only be used by our SPARKs. Its capability is now further improved by magnetic weapon tech."

[Tech_SPARKCannon_CG X2TechTemplate]
DisplayName="BSG-20 Gauss-Cannon"
Summary="Gatling Cannons are much heavier versions of the miniguns carried by regular soldiers. This robust weapon provides heavy firepower and can only be used by our SPARKs. Its capability is now further improved by coil weapon tech."

[Tech_SPARKCannon_BM X2TechTemplate]
DisplayName="BSG-25 Plasma Minigun"
Summary="Gatling Cannons are much heavier versions of the miniguns carried by regular soldiers. This robust weapon provides heavy firepower and can only be used by our SPARKs. Its capability is now further improved by plasma weapon tech."

[SPARKCannon_CV X2WeaponTemplate]
FriendlyName="BSG-09 Gatling Cannon"
FriendlyNamePlural="BSG-09 Gatling Cannon"
BriefSummary="A powerful but physically-heavy cannon designed specifically for use by SPARK units."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="BSG-09 Gatling Cannon"

[SPARKCannon_LS X2WeaponTemplate]
FriendlyName="BSG-12 Laser Minigun"
FriendlyNamePlural="BSG-12 Laser Minigun"
BriefSummary="A powerful but physically-heavy cannon designed specifically for use by SPARK units."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="BSG-12 Laser Minigun"

[SPARKCannon_MG X2WeaponTemplate]
FriendlyName="BSG-17 Rail-Cannon"
FriendlyNamePlural="BSG-17 Rail-Cannon"
BriefSummary="A powerful but physically-heavy cannon designed specifically for use by SPARK units."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="BSG-17 Rail-Cannon"

[SPARKCannon_CG X2WeaponTemplate]
FriendlyName="BSG-20 Gauss-Cannon"
FriendlyNamePlural="BSG-20 Gauss-Cannon"
BriefSummary="A powerful but physically-heavy cannon designed specifically for use by SPARK units."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="BSG-20 Gauss-Cannon"

[SPARKCannon_BM X2WeaponTemplate]
FriendlyName="BSG-25 Plasma Minigun"
FriendlyNamePlural="BSG-25 Plasma Minigun"
BriefSummary="A powerful but physically-heavy cannon designed specifically for use by SPARK units."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="BSG-25 Plasma Minigun"

[LegionModeSwitch_Short X2AbilityTemplate]
LocFriendlyName="Close Range Mode"
LocLongDescription="Switch to close range mode. Improve accuracy and critical chance with proximity to target."
LocHelpText="Switch to close range mode. Improve accuracy and critical chance with proximity to target."
LocFlyOverText="Close Range Mode"

[LegionModeSwitch_Long X2AbilityTemplate]
LocFriendlyName="Long Range Mode"
LocLongDescription="Switch to long range mode for increased sight radius. Improve accuracy and critical chance with distance to target."
LocHelpText="Switch to long range mode for increased sight radius. Improve accuracy and critical chance with distance to target."
LocFlyOverText="Long Range Mode"

[LegionGunShield X2AbilityTemplate]
LocFriendlyName="Gun Shield"
LocLongDescription="Project an energy shield in front of the weapon to block incoming attacks and return fire to attacker. Last 1 turns or after absorbing 20 damage."
LocHelpText="Absorb up to 20 damage and return fire to attacker. Cannot be used after movement. Last 1 turns."
LocFlyOverText="Gun Shield"

[LegionGunShieldMk2 X2AbilityTemplate]
LocFriendlyName="Gun Shield"
LocLongDescription="Project an energy shield in front of the weapon to block incoming attacks and return fire to attacker. Last 1 turns or after absorbing 30 damage."
LocHelpText="Absorb up to 30 damage and return fire to attacker. Cannot be used after movement. Last 1 turns."
LocFlyOverText="Gun Shield"

[LegionPowerShot_Long X2AbilityTemplate]
LocFriendlyName="Power Shot (Long Range)"
LocLongDescription="Fire a long range projectile which pierces through and damages all units in a straight line."
LocHelpText="Fire a long range projectile which pierces through and damages all units in a straight line."

[LegionPowerShot_Short X2AbilityTemplate]
LocFriendlyName="Power Shot (Close Range)"
LocLongDescription="Fire a cluster of short range projectiles which damage all units within a cone."
LocHelpText="Fire a cluster of short range projectiles which damage all units within a cone."

[LegionSmartCore X2AbilityTemplate]
LocFriendlyName="Smart Core"
LocLongDescription="Unleash all remaining ammo of primary weapon (+6 more shots) to enemies within sight. Shoot up to 12 times and each shot has 100% accuracy."
LocHelpText="Unleash all remaining ammo of primary weapon (+6 more shots) to enemies within sight. Shoot up to 12 times and each shot has 100% accuracy."
LocFlyOverText="Smart Core"

[LegionSmartCoreMk2 X2AbilityTemplate]
LocFriendlyName="Smart Core"
LocLongDescription="Unleash all remaining ammo of primary weapon (+8 more shots) to enemies within sight. Shoot up to 16 times and each shot has 100% accuracy."
LocHelpText="Unleash all remaining ammo of primary weapon (+8 more shots) to enemies within sight. Shoot up to 16 times and each shot has 100% accuracy."
LocFlyOverText="Smart Core"